suffixes = [
        # کوتاه‌ها:
        "ی",  # کارگری، دانایی
        "ها",  # کتاب‌ها، واژه‌ها
        "هایی",  # کتاب‌هایی، نمونه‌هایی
        "ترین",  # زیباترین، سریع‌ترین

        # بلندترها:
        "یابی",  # کاریابی، داناییابی
        "گرایی",  # ملی‌گرایی، خودگرایی
        "پذیر",  # کارپذیر، انتقادپذیر
        "وار",  # مردوار، سنگ‌وار
        "واره",  # هوشواره، آواواره
        "کده",  # تارکده، دانشکده
        "سرا",  # کاروانسرا، کتابسرا
        "بند",  # مچ‌بند، گردنبند
        "آور",  # یادآور، دردآور
        "ور",  # فناور، نام‌ور
        "آفرین",  # کارآفرین، نوآفرین
        "وند",  # شهروند، فرهیخته‌وند
        "نما",  # چهره‌نما، سازنما
        "چه",  # بازیچه، آزمایچه
        "َک",  # پیامک، نگاهک، هفتک
        "ندگی",  # زندگی، سازندگی
        "آگین",  # خون‌آگین، دودآگین
        "انگ",  # خنده‌انگ، درد‌انگ (نسبتاً امن)
        "چین",  # روچین، گلچین
        "زیست",  # دوزیست، هم‌زیست
        "زی",  # آبزی، خشکی‌زی
        "دان",  # سزه‌دان، آبزی‌دان
        "کُن",  # خشک‌کن، موخشک‌کن
        "کار",  # فراموشکار، دیرکار
        "گار",  # آموزگار، سازگار
        "شناس",  # کارشناس، زبان‌شناس
        "شناسی",  # دیتاشناسی
        "پرداز",  # خودپرداز، نگاره‌پرداز
        "پرداخت",  # خودپرداخت، پیش‌پرداخت
        "داشت",  # چشم‌داشت، امیدداشت
        "دار",  # پولدار، دانادار
        "نامه",  # کارنامه، سرگذشت‌نامه
        "بان",  # نگهبان، شب‌بان
        "سازی",  # الگوریمسازی
]

suffix_pattern = '(?:' + '|'.join(suffixes) + ')'

TRANSLATE_TABLE = str.maketrans({
        'ك': 'ک', 'ي': 'ی', 'ى': 'ی', 'ہ': 'ه',
        'ٱ': 'ا',
        'ٓ': '', 'ٰ': '', 'ٖ': '', 'ٗ': '', 'ۘ': '', 'ـ': '',

        'څ': 'س', 'ښ': 'ش', 'ډ': 'د', 'ټ': 'ت', 'ڼ': 'ن', 'ړ': 'ر',
        'ږ': 'ژ', 'ڂ': 'س', 'ڒ': 'ز', 'ڔ': 'ر', 'ڞ': 'ص', 'ۏ': 'و', 'ڑ': 'ر',
        'ڽ': 'ن', 'ڹ': 'ن', 'ڜ': 'ش', 'ڠ': 'گ', 'ڭ': 'گ', 'ڰ': 'ک', 'ڱ': 'گ',
        'ڳ': 'گ', 'ګ': 'گ', '۾': 'م', 'ڤ': 'ق', 'ڦ': 'ف', 'ڷ': 'ل', 'ڿ': 'ک',
        'ٹ': 'ت', 'ڀ': 'ب', 'ۄ': 'و', 'ۅ': 'و', 'ۉ': 'و', 'ۈ': 'و',
        'ڛ': 'س',

        '؀': '', '؁': '', '؂': '', '؃': '', '؄': '',

        'ﺁ': 'آ', 'آ': 'آ', 'ٲ': 'ا', 'ﺍ': 'ا', 'ﺎ': 'ا',
        'ﺐ': 'ب', 'ﺏ': 'ب', 'ﺑ': 'ب', 'ﭖ': 'پ', 'ﭗ': 'پ', 'ﭙ': 'پ', 'ﺒ': 'پ', 'ﭘ': 'پ',
        'ﭡ': 'ت', 'ٺ': 'ت', 'ٹ': 'ت', 'ﭞ': 'ت', 'ٿ': 'ت', 'ټ': 'ت', 'ﺕ': 'ت', 'ﺗ': 'ت', 'ﺖ': 'ت', 'ﺘ': 'ت',
        'ﺙ': 'ث', 'ﺛ': 'ث',
        'ﺝ': 'ج', 'ڃ': 'ج', 'ﺠ': 'ج', 'ﺟ': 'ج',
        'ﭽ': 'چ', 'ﭼ': 'چ',
        'ﺢ': 'ح', 'ﺤ': 'ح', 'څ': 'ح', 'ﺣ': 'ح',
        'ﺥ': 'خ', 'ﺦ': 'خ', 'ﺨ': 'خ', 'ﺧ': 'خ',
        'ڏ': 'د', 'ډ': 'د', 'ﺪ': 'د', 'ﺩ': 'د',
        'ﺫ': 'ذ', 'ﺬ': 'ذ', 'ﻧ': 'ذ',
        'ڙ': 'ر', 'ڗ': 'ر', 'ڒ': 'ر', 'ڑ': 'ر', 'ڕ': 'ر', 'ﺭ': 'ر', 'ﺮ': 'ر', 'ݳ': 'ر',
        'ﺰ': 'ز', 'ﺯ': 'ز',
        'ﮊ': 'ژ',
        'ݭ': 'س', 'ݜ': 'س', 'ﺱ': 'س', 'ﺲ': 'س', 'ښ': 'س', 'ﺴ': 'س', 'ﺳ': 'س',
        'ﺵ': 'ش', 'ﺶ': 'ش', 'ﺸ': 'ش', 'ﺷ': 'ش',
        'ﺺ': 'ص', 'ﺼ': 'ص', 'ﺻ': 'ص', 'ڞ': 'ص',
        'ﺽ': 'ض', 'ﺾ': 'ض', 'ﺿ': 'ض', 'ﻀ': 'ض',
        'ﻁ': 'ط', 'ﻂ': 'ط', 'ﻃ': 'ط', 'ﻄ': 'ط',
        'ﻆ': 'ظ', 'ﻇ': 'ظ', 'ﻈ': 'ظ',
        'ڠ': 'ع', 'ﻉ': 'ع', 'ﻊ': 'ع', 'ﻋ': 'ع',
        'ﻎ': 'غ', 'ۼ': 'غ', 'ﻍ': 'غ', 'ﻐ': 'غ', 'ﻏ': 'غ',
        'ﻒ': 'ف', 'ﻑ': 'ف', 'ﻔ': 'ف', 'ﻓ': 'ف', 'ڦ': 'ف',
        'ﻕ': 'ق', 'ڤ': 'ق', 'ﻖ': 'ق', 'ﻗ': 'ق',
        'ڭ': 'گ', 'ﻚ': 'ک', 'ﮎ': 'ک', 'ﻜ': 'ک', 'ﮏ': 'ک', 'ګ': 'گ', 'ﻛ': 'ک', 'ﮑ': 'ک', 'ﮐ': 'ک', 'ڪ': 'ک', 'ك': 'ک',
        'ڰ': 'گ', 'ڿ': 'چ', 'ݴ': 'ل', 'ݵ': 'ی',
        'ﮚ': 'گ', 'ﮒ': 'گ', 'ﮓ': 'گ', 'ﮕ': 'گ', 'ﮔ': 'گ', 'ݶ': 'ی', 'ݷ': 'ی',
        'ﻝ': 'ل', 'ﻞ': 'ل', 'ﻠ': 'ل', 'ڵ': 'ل', 'ݸ': 'ل',
        'ﻡ': 'م', 'ﻤ': 'م', 'ﻢ': 'م', 'ﻣ': 'م', '۾': 'م', 'ݺ': 'م',
        'ڼ': 'ن', 'ﻦ': 'ن', 'ﻥ': 'ن', 'ﻨ': 'ن', 'ں': 'ن', 'ڽ': 'ن', 'ڹ': 'ن', 'ݲ': 'ح', 'ݩ': 'ن', 'ݹ': 'ن',
        'ވ': 'و', 'ﯙ': 'و', 'ۈ': 'و', 'ۋ': 'و', 'ﺆ': 'و', 'ۊ': 'و', 'ۇ': 'و', 'ۏ': 'و', 'ۅ': 'و', 'ۉ': 'و', 'ﻭ': 'و',
        'ﻮ': 'و',
        'ﺔ': 'ه', 'ﻬ': 'ه', 'ھ': 'ه', 'ﻩ': 'ه', 'ﻫ': 'ه', 'ﻪ': 'ه', 'ۀ': 'ه', 'ە': 'ه', 'ة': 'ه', 'ہ': 'ه', 'ݻ': 'ه',
        'ﭛ': 'ی', 'ﻯ': 'ی', 'ۍ': 'ی', 'ﻰ': 'ی', 'ﻱ': 'ی', 'ﻲ': 'ی', 'ﻳ': 'ی', 'ﻴ': 'ی', 'ﯼ': 'ی', 'ې': 'ی', 'ﯽ': 'ی',
        'ﯾ': 'ی', 'ﯿ': 'ی', 'ێ': 'ی', 'ے': 'ی', 'ى': 'ی', 'ي': 'ی', 'ݼ': 'چ',

        'ڕ': 'ر',
        'ع': 'ع',
        'و': 'و',
        'ا': 'ا',
        'س': 'س',
        'م': 'م',
        'ڛ': 'س',
        'ځ': 'ح',
        'ڬ': 'گ',
        'ۺ': 'ش',
        'ٔ': '',
        'ٕ': '',
        'ػ': 'ک',
        'ؽ': 'ی',
        'ؼ': 'ک',
        'ؾ': 'ی',

        '\u200B': '',
        '\u200D': '',
        '\u2060': '',
        '\u2061': '',
        '\u2062': '',
        '\u2063': '',
        '\u2064': '',
        '\u2028': ' ',
        '\u2029': '\n',
        '\uFEFF': '',
        '\u202F': '',
        'ڨ': 'گ',
        'ڥ': 'ف',
        'ڧ': 'ف',
        'ڟ': 'ط',
        'ؼ': 'ک',
        'ؽ': 'ی',
        'ؾ': 'ی',
        'ؿ': 'ی',
        'ݐ': 'پ',
        'ݑ': 'ب',
        'ݒ': 'پ',
        'ݓ': 'ت',
        'ݔ': 'ی',
        'ݕ': 'ب',
        'ݖ': 'ن',
        'ݗ': 'ح',
        'ݘ': 'چ',
        'ݙ': 'د',
        'ݚ': 'د',
        'ݛ': 'ر',
        'ݝ': 'غ',
        'ݞ': 'ع',
        'ݟ': 'غ',
        'ݮ': 'چ',
        'ݯ': 'چ',
        'ݰ': 'ش',
        'ݱ': 'ژ',
        'ݳ': 'ا',
        'ݴ': 'ا',
        'ݵ': 'ی',
        'ݶ': 'ی',
        'ݷ': 'ی',
        'ݸ': 'و',
        'ݹ': 'و',
        'ݺ': 'ی',
        'ݻ': 'ی',
        'ݼ': 'چ',
        'ݽ': 'س',
        'ݾ': 'ش',
        'ݿ': 'ک',
        'ګ': 'ک',

        '\u200b': '',  # ZERO WIDTH SPACE
        '\u200d': '',  # ZERO WIDTH JOINER
        '\u200e': '',  # LEFT-TO-RIGHT MARK
        '\u200f': '',  # RIGHT-TO-LEFT MARK
        '\u202a': '',  # LEFT-TO-RIGHT EMBEDDING
        '\u202b': '',  # RIGHT-TO-LEFT EMBEDDING
        '\u202c': '',  # POP DIRECTIONAL FORMATTING
        '\u202d': '',  # LEFT-TO-RIGHT OVERRIDE
        '\u202e': '',  # RIGHT-TO-LEFT OVERRIDE
        '\u2066': '',  # LEFT-TO-RIGHT ISOLATE
        '\u2065': '',  # LEFT-TO-RIGHT ISOLATE
        '\u2067': '',  # RIGHT-TO-LEFT ISOLATE
        '\u2068': '',  # FIRST STRONG ISOLATE
        '\u2069': '',  # POP DIRECTIONAL ISOLATE
        '\u2060': '',  # WORD JOINER
        '\u2061': '',  # FUNCTION APPLICATION
        '\u2028': ' ',  # LINE SEPARATOR
        '\u2029': '\n',  # PARAGRAPH SEPARATOR
        '\u061C': '',
        '\u206a': '',
        '\u206b': '',
        '\ufeff': '',  # ZERO WIDTH NO-BREAK SPACE (BOM)
        '\u200B': '',  # Zero Width Space
        '\u200D': '',  # Zero Width Joiner
        '\u2060': '',  # Word Joiner
        '\u2061': '',  # Function Application
        '\u2062': '',  # Invisible Times
        '\u2063': '',  # Invisible Separator
        '\u202C': '',  # Pop Directional Formatting
        '\u202D': '',  # Left-To-Right Override
        '\u202E': '',  # Right-To-Left Override
        '\u202A': '',  # Left-To-Right Embedding
        '\u202B': '',  # Right-To-Left Embedding
        '\u034F': '',  # Combining Grapheme Joiner
        '\uFEFF': '',  # Zero Width No-Break Space
        '\u034F': '',
        '\u200C': ' '

})

contextual_patterns = [
        "(حافظ) شیرازی",
        "اشعار (حافظ)",
        "فال (حافظ)",
        "دیوان (حافظ)",
        "آرامگاه (حافظ)",
        "سروده (حافظ)",
        "(سعدی و حافظ)",
        "(کره) شمالی",
        "(کره) جنوبی",
        "کشور (کره)"
        "شعر (حافظ)",
        "(سعدی)",
        "(امیر کبیر)",
        "(عطار) نیشابوری",
        "(شیخ) بهایی",
        "(شمس) تبریزی",
        "(فردوسی)",
        "(نادر) شاه",
        "قیصر (امین) پور",
        "لیلا (کسری)",
        "گل (یاس)",
        "(فرح) دیبا",
        "مهران (مدیری)",
        "(وحشی) بافقی",
        "(عارف) قزوینی",
        "بابا (طاهر)",
        "(رضا عطاران)",
        "آقای (مدیری)",
        "سروش (صحت)",
        "(مسعود) پزشکیان",
        "(ابراهیم رئیسی)",
        "(ابراهیم رییسی)",
        "(حسن روحانی)",
        "(صادق هدایت)",
        "(کزازی)",
        "محمود (حسابی)",
        "(حسن) دوست",
        "(ادیب سلطانی)",
        "می (شوم)",
        "(کدبان)",
        "می (برند)",
        "(بینی)",
        "(هرجور)",
        "(درمی) آورد",
        "(درمی) اورد",
        "می (رم)",
        "(درمی) آرد",
        "(درمی) ارد",
        "آب (پز)",
        "بخار (پز)",
        "زود (پز)",
        "آرام (پز)",
        "کباب (پز)",
        "پلو (پز)",
        "مامان (پز)",
        "پخت و (پز)",
        "(ملک خانی)",
        "(مهدی)",
        "(جوی)",
        "(چت) جی پی تی",
        "(خیرها)",
        "(خیری)",
        "(خیرشناسی)"
        "(خیرشناس)",
]
